<template>
	<div class="article">
		<!-- 文章投稿页面 -->
		<div class="article_banner">
			
		</div>
		<div class="article_body">
			<div class="article_body_item" v-if="ArticleIndex==0" >
				<div class="article_title">
					铮铮誓言 不忘初心
				</div>
				<div class="article_o">
					
					<div class="article_name">作者：许夏</div>
					
				</div>
				<div class="article_content">
十九大的主题是：不忘初心，牢记使命，高举中国特色社会主义伟大旗帜，决胜全面建成小康社会，夺取新时代中国特色社会主义伟大胜利，为实现中华民族伟大复兴的中国梦不懈奋斗。<br>
抚今思昔，展望未来，每一位共产党人只有不忘初心，继续前进，我们党的事业才能善始善成，方得始终。<br>
“不忘初心，方得始终”解读自《严华经》，意思是一个人做事情，始终如一的保持当初的信念，最后就一定能得到成功。<br>
五年前，“我志愿成为中华人民共和国人民警察，献身于崇高的人民公安事业，坚决做到对党忠诚、服务人民、执法公正、纪律严明……”铮铮的入警誓言,犹在耳畔。刚跨出校门懵懵懂懂的普通院校毕业生，机缘巧合下穿上警服，成为一名光荣的人民警察，是惊喜、是茫然、是骄傲，是一切从零开始。我知道，从那一刻起，我必须脚踏实地，勤学苦练，严守纪律，砥砺前行，争做合格的人民警察。<br>
随着时间流逝，入警时的那份淳朴之心却从未改变。而今作为一名警保民警，日常工作琐碎繁杂，虽然没有轰轰烈烈的英雄事迹，也没有可歌可泣的动人故事，但始终保持着一颗热诚服务的心，全心全意为全局民警办实事、解难题。回顾四年，深知要做好财务工作务必具备三个“心”。<br>
做业务要细心。财务工作涉及的是现金收付、银行结算等活动，直接关系到民警、职工个人、单位乃至国家的经济利益，一旦出现差错，就可能造成不可挽回的损失。在处理审核每年数以万计的单据时，务必要细心，集中精力、有条不紊；面对不断更新的财务政策，务必要细心，认真研读，反复推究。<br>
待同事要热心。作为财务窗口，面向的是全局民警，热心的接待每一位来报销的民警职工，用所学的专业知识、即时的财务政策解答他们的疑问。<br> 
遇诱惑要有决心。资金保障是全局正常运行的基础，财务人员作为资金和账务的执行者和管理者，必须谨慎职业，具有辨别是非的能力和抵制不良诱惑的决心。日常工作中，要认真学习并严格执行国家有关党风廉政建设规定，从思想上筑牢反腐倡廉、拒腐防变的堤防，坚决抵制各种社会不良风气的侵蚀和诱惑，爱岗敬业，诚实守信，廉洁自律，客观公正，坚持准则，提高技能，参与管理和强化服务。<br>
“不忘初心，牢记使命，永远奋斗”，无论身处何时何地，何种岗位，立足自身，积极进取，以饱满的政治热情、高昂的精神状态、真诚的服务态度，履职尽责，努力做一名合格的党员、合格的人民警察。<br>
将来，不论我们走了多久、多远，身心有多疲累，我们的内心深处都要永远记住自己当初是为什么而出发，身上背负了什么样的责任，只有铭记这些，人生才不会偏离方向。
铮铮誓言在耳畔，不忘初心得始终！<br>
				</div>
				
			</div>
			<div class="article_body_item" v-if="ArticleIndex==1">
				<div class="article_title">
					乘风破浪扬帆进 意气风发进行时
				</div>
				<div class="article_content">
					嘉兴，红船——党的诞生地，南湖革命纪念馆——记载了中国共产党领航中国号巨轮破浪前行的足迹，“红船精神”是开天辟地、敢为人先的首创精神，坚定理想、百折不挠的奋斗精神，立党为公、忠诚为民的奉献精神。我们出生在这片红土上，并在这片红土上茁壮成长，我为自己是嘉兴人民而骄傲、自豪。而警察——一个挥洒着汗水与青春，没有鲜花和掌声，却与犯罪分子打交道的可爱的人，充满着满满正能量的人。<br>
作为一名派出所的辅警，接触这个岗位已经八年多，在这里，见证了多多少少的风风雨雨，见证了警察将青春凝结成汗水与微笑，忠诚与干劲，深深烙印在滚烫的青春旗帜上，猎猎飞扬在祖国人民平安的心中。<br>
于城所副所长吴琴飞同志，平时为人比较低调，话也不多，典型的实干家。如何提升辖区群众的幸福指数？如何降低辖区的发案率？这些都是他日思夜想的大事，为了干好岗位，他愿意花时间捧起书本熟读法律，和同事们交流学习丰富办案经验；为了侦破案件，他愿意加班加点收集线索，不放过任何一个违法嫌疑人，“我爱这份职业。我乐意为老百姓办点实事，解点难题”这是他的心里话，也是所有警察的心里话！ <br>
社区民警许佳，警校毕业后被分配至派出所户籍窗口，为了让自己在最短的时间内熟悉相关法律法规，她放弃休息时间，认真阅读并做好笔记，厚厚的笔记本里记满了她的重点、难点、要点，在她的努力下，一个多月的时间，从简单的身份证办领、分户、户口迁移到疑难问题、特殊问题，都能熟练地操作。2016年8月，岗位的调动让她手足无措，为尽快投入到新的工作，熟悉自己的辖区，许佳把自己才两周岁的孩子交给婆婆，放弃中午和晚上的休息时间，一门心思地投入到了工作中去。手绘地图、拍摄照片、走访排摸、发放名片……只要她能想到的方法，她都用了上去<br>，上班时间走访企业，午休、晚上的时间走访群众，短短两个多星期，辖区的群众竟然都知道这次村里来了一个“美女警察”，“许佳”这个名字也渐渐地在辖区有个知名度……
其实，这样的案例举不胜举，正是因为有他们这群可爱的人的存在，我们的治安环境和谐，群众的幸福指数大幅度提高。对党忠诚，服务人民、执法公正、纪律严明，是我们习近平总书记在会见全国公安系统英雄模范立功集体表彰大会代表时强调的，一句话简单的16个字，包含了对公安工作的要求与期许，嘉兴南湖红船是党梦想起航的地方，这里，亦是我们梦想开始的地方，让我们乘风破浪扬帆进，意气风发再出发！<br>
				</div>
			</div>
			<div class="article_body_item" v-if="ArticleIndex==2">
				<div class="article_title">
					以人民为中心， 愿做一颗平安基石
				</div>
				<div class="article_o">
					
					<div class="article_name">作者：何雪红</div>
					
				</div>
				<div class="article_content">
在繁华的都市，当我们登高远眺时，映入你眼帘的是数不清的高楼大厦，那你可曾想到支撑大厦的那些默默无闻的颗颗基石吗？它们永远没有大厦的雄伟壮丽，没有令人瞩目的绚丽光彩，更不会听到路人的赞叹，可它们依然坚守在自己平凡的岗位，相互团结，手挽着手，奉献出自己所拥有的一切，我喜欢这些可爱的基石，也愿做一颗社会的基石，筑起社会的平安，换来万家灯火的宁静，把我的青春和汗水奉献给我热爱的公安事业。<br>
习近平同志在党的十九大报告中把坚持以人民为中心作为新时代坚持和发展中国特色社会主义的重要内容。他强调：人民是历史的创造者，是决定党和国家前途命运的根本力量。必须坚持人民主体地位，坚持立党为公、执政为民，践行全心全意为民服务的根本宗旨，把党的群众路线贯彻到治国理政全部活动之中，把人民对美好生活的向往作为奋斗目标，依靠人民创造历史伟业。我是一名社区民警，作为一名人民警察，全心全意为民服务，保一方平安是职责所在，我要以十九大精神来引领新时代的公安工作。在这平凡的岗位上，踏踏实实做事，用实际行动践行一名普通警察为人民服务的誓言，让闪光的警徽渲染着一身绽蓝。<br>
因为社区民警服务对象是社区居民，要想服务好，就必须深入到他们中间，了解他们，熟悉社区环境。刚到社区时由于我是宁波人，不熟悉海盐方言，沟通存在障碍，为尽快适应工作，我努力学习海盐方言，在工作中，尽量让同事们讲海盐话，提高沟通能力，通过一段时间的努力，听海盐话的能力大大提高，有时也能用海盐话和社区居民进行交流，我觉得心和他们贴得更近了；同时我还找了一张辖区地图熟悉周边的道路、建筑和小区的名称，下班没事，就一个人走街串巷，不为在商场购物、寻找可口的美食，而是了解社区建筑物的位置和道路走向，用心记忆，为今后能及时处警办案奠定基础。同事们开玩笑说“社区民警就是运动员”，我也深有体会。社区走访是最考验跑功的，每天根据工作的安排，定期走访一些辖区的居民，及时了解他们的想法，熟悉他们居住的位置，做到心中有数。<br>
 在这几年的工作经历中，我感触最深的是作好社区民警要有“三心”，首先，要有爱心，每一个社区就是一个大家庭，每一个居民，都是我们的亲人，在工作中就像关心自己家人一样，关心他们，了解他们，认识他们，不但要了解每户居民的家庭成员，工作状况，还要了解他们的住址和生活、爱好，做到心中有数，及时掌握社区的人员变化，更重要的是通过访谈尽最大努力，解决社区居民的困难；其次，工作要细心，在社区走访、巡逻和处理纠纷、案件的过程中，不是走马观花，而是观察社区环境的变化，通过街头巷尾百姓们热论的话题，了解社区治安状况、治安安全隐患和社区人员关心的热点问题和时间，及时提醒广大居民增强安全防范的意识，减少社区案件的发生，增加社区的团结；第三，要有恒心，我从作社区民警的那一天就明白，社区民警的工作是一项烦杂、琐碎的工作，虽然细小，但是关系着千家万户的幸福和安宁，每天都是很多诸如邻里纠纷、家庭不和、门打不开、丢了东西等在别人看起来的很小的小事，我都会满怀工作热情认真处理，因为我知道，作为社区民警，没有小事，社区居民的事都是大事，耐心了解事情原委，一件一件加以落实解决，如果这些小事处理不好，就会影响家庭和睦、邻里团结、社区治安。<br>
每当我走在熟悉的社区，看着人们轻松的脚步，不时和迎面走过熟识的老人、可爱的孩子打着招呼，眼前闪过曾经调解过家庭不和，又甜蜜如初的夫妻背影，还有一张张幸福快乐的笑脸，我心中升起乐无限的自豪，早已忘记了雪夜巡逻的辛苦，假日值班的疲劳，社区中走访、调解中被误解的委屈，走痛的双脚，故乡亲人的思念，有的是对社区民警工作的热爱，有的是投入社区治安工作的热情和动力，我愿做一颗平安基石，为构建和谐美丽社会，贡献一点绵薄之力。<br>
				</div>
				<!-- <div class="article_o_l">
					<div class="article_o_lt">作品类别：征文</div>
					<div class="article_o_lt">作品名称：《以人民为中心， 愿做一颗平安基石》</div>
					<div class="article_o_lt">作者姓名：何雪红</div>
					<div class="article_o_lt">单位：海盐县公安局秦山派出所</div>
					<div class="article_o_lt">职务：民警</div>
					<div class="article_o_lt">联系方式：13456319560</div>
				</div> -->
			</div>
			<div class="article_body_item" v-if="ArticleIndex==3">
				<div class="article_title">
					不忘初心 砥砺前行 我们在路上
				</div>
				<div class="article_o">
					
					<div class="article_name">作者：杨群芳</div>
				</div>
				<div class="article_content">
				在语义学上，“初心”就是出发时的目标、誓言或承诺。恩格斯说：“一个知道自己的目的，也知道怎样达到这个目的的政党，一个真正想达到这个目的的并且具有达到这个目的所必不可缺的顽强精神的政党—这样的政党将是不可战胜的。”近代以来，中国人民长期奋斗的历史足以说明，中国共产党就是这样的党。<br>
十九大报告核心关键词，不忘初心，牢记使命。“不能忘记为什么出发”，联想到我们的从警初心，那也是一份沉甸甸的责任和使命。正如人民警察警歌中所唱的那样，“伟大的祖国富裕我使命，复兴的民族给予我力量，忠诚的道路浴血荣光，英雄的足迹越走越长，对党忠诚，服务人民，执法公正，纪律严明。”我们不忘初心，砥砺前行，践行十九大精神，诠释人民警察警魂，始终在路上。<br>
我身边的这群战友，他们正像习总书记说得那样，在践行十九大精神的路上，勇往之前。在打击犯罪、保护人民的关键时刻挺身而出、冲锋在前，在重大安保任务面前不怕疲劳、连续作战，长期默默无闻、甘当无名英雄，在平凡的工作岗位上像老黄牛一样辛勤耕耘、当好“螺丝钉”。<br>
熬过无数通宵，面对危险无所畏惧的钟晓，我们港区分局乍浦派出所分管办案副所长。作为抓捕行动的负责人，在每次抓捕前，他都要亲自研究方案，布置行动，绝不允许计划出现一丝纰漏，纵使通宵达旦，他的脸上也看不出一丝疲惫。<br>
每一次抓捕他都在现场，每一次执行任务都有他坐镇，兄弟们说，“有钟所在，踏实，安心！”5.8非法拘禁案、5.5砸车盗窃案，6.21抢劫案件等等，在他的带领下，快速反应，快破案，快追赃。他，睿智，勇敢，更为重要的是他对公安工作始终保持着忠诚和热爱。他将每一次抓捕任务看成新的挑战，敢于攻坚克难，敢于往前冲，他将对公安工作的热爱转化为无尽的勇气与动力。<br>
公安工作不仅要面对穷凶极恶的犯罪分子，还有很多亟需帮助的普通群众。因此警察不仅需要铁血与勇气，还要有为民服务的柔情。<br>
他在面对群众时总是那么用心、耐心、有心，露出八颗牙的笑容，总是能让群众感受到37°的温暖，他就是我们的社区民警孙灿灿，大家都亲切地喊他一声“灿灿”。作为社区民警，他对辖区几户几人，细到哪家有几个人、分别叫什么名字、从事什么职业、有什么爱好，都十分清楚。他说：“我就是一名普通的社区民警，让群众平安快乐，就是我的责任。”而群众则说：“以前不知道什么叫社区民警。他来了之后，我们才知道，原来社区民警就是政府派来给我们解决困难的。”金阿姨是灿灿在走访中认识的，早年丈夫去世，儿子又身患残疾，娘俩相依为命，生活着实清贫。灿灿把阿姨一家作为重点照顾对象，并叮嘱“阿姨，有事一定找我，我保证随叫随到。”金阿姨说“我是不幸的，但是我又是幸运的，因为我有一个人民警察儿子。”得知阿姨想为身患残疾的儿子办残疾证时，灿灿主动帮忙打听，带着母子二人跑医院、跑政府、跑残联。终于，把证给办了下来。当他把证送到老人手上时，老人感动的紧紧握着他的手不肯放开。<br>
正是有了这些不忘初心，始终砥砺前行的平凡战士，才有了我们社会的平安和安宁。<br>
我们郑重宣誓：我保证忠于中国共产党，忠于祖国，忠于人民，忠于法律；服务命令，听从指挥；严守纪律，保守秘密；秉公执法，清正廉洁；恪尽职守，不怕牺牲；全心全意为人民服务。我愿现身于崇高的人民公安事业，为实现自己的誓言而努力奋斗。<br>
				</div>
				
			</div>
						<div class="article_body_item" v-if="ArticleIndex==4">
				<div class="article_title">
					不忘初心 砥砺前行
				</div>
				<div class="article_o">
					<div class="article_name">作者：郭庭瑞</div>
				</div>
				<div class="article_content">
				中国共产党第十九次全国人民代表大会的召开，预示着中国特色社会主义发展进入了新时代，描绘了全面建成小康社会的新征程，揭开了中华民族伟大复兴的新篇章。作为新时代青年民警，我们在党的十九大精神指引下，必须牢记为党和人民的事业而努力奋斗的时代使命，必须为实现从警喊出的铮铮誓词而砥砺前行。<br>
时代发展的脚步从未停歇，从南湖红船中代代传递的精神火种也从未熄灭，十九大的召开已将我们青年一代召唤，只有信念更加坚定，队伍更加正规，工作更加扎实，效率更加提高才能担当起时代的使命。<br>
坚定信念，增强信心。历史的长河证明中国特色社会主义道路的唯一性与必然性，坚持党委政府的领导是重要的政治意识，是不能动摇的政治决心，公安机关作为行政机关，必须坚持党委政府的领导，而作为青年民警，更加笃定在党委领导下，小民警也能发挥大价值。<br>
严守纪律，听从指挥。党的十八大以来，诸见报端的“老虎落马”事件一次次提醒着我们要恪守底线，纪律意识不能淡薄，万万不能把手中的权力当作换自己享乐的利器。而作为青年民警，更应该成为公安队伍中的典范，保证队伍的纯洁性；听从指挥，服从命令，保证队伍的战斗力，树立公安铁军的形象。<br>
夯实基础，踏实工作。“大鹏之动，非一羽之轻；骐骥一跃，非一足之力”，唯有实干才能谋求实绩，心有大我才能共担伟业。今年是“四个年”建设中的基础管控年，在以反恐标准抓实基层基础管控的高标准严要求下，力争为维护社会大局持续和谐稳定提供最坚实的基础支撑。因此在11月中旬将开展的乌镇互联网大会安保清查工作，便是我们工作细致程度的再一次检验。<br>
勤学多思，智慧应用。当前公安工作中越来越多应用到了智慧警务、大数据警务、互联网+警务，这也是现代化警务模式转型升级的必经之路，作为青年民警，只有通过不断地学习，熟练掌握智慧警务的实际应用方法与场景，才能真正融会贯通，让智慧警务助力工作效率。<br>
不忘初心，服务人民。说到底，人民警察为人民，一切的出发点还是人民，为了人民群众的利益，做些实事，无论大小，这也是一个警察的修养，是我们青年一代要修炼的心境。路漫漫其修远兮，警察生涯还长，社会主义道路还长，年轻一代的我们定将深刻领悟新时代中国特色社会主义思想，扛起人民警察的使命与担当！
				</div>
				
			</div>
			<div class="article_op">
				<div class="article_pageup" v-if="PageUp" @click="PageUpTo">
					<div class="article_pageup_icon"></div>
					上一篇
				</div>
				<div class="article_pagedown" v-if="PageDown" @click="PageDownTo">
					<div class="article_pagedown_icon"></div>
					下一篇
				</div>
			</div>
			<div class="article_bottom">
				
			</div>
		</div>
		<div class="article_contribute" @click="Contribute">
			投稿
		</div>
	</div>
</template>
<script>
export default{
	data(){
		return{
			ArticleIndex:0,
			PageUp:false,
			PageDown:true
		}
	},
	watch:{
		ArticleIndex(){
			if (this.ArticleIndex==0) {
				this.PageUp=false
			}else{
				this.PageUp=true
			}
			if (this.ArticleIndex==4) {
				this.PageDown=false
			}else{
				this.PageDown=true
			}
			 window.scrollTo(0,0);
		}
	},
	created(){
		window.scrollTo(0,0);
	},
	methods:{
		PageUpTo(){
			this.ArticleIndex--
		},
		PageDownTo(){
			this.ArticleIndex++
		},
		Contribute(){
			this.$router.push({
				path:'/contribute'
			})
		}
	}
}
</script>
<style scoped>
.article_banner{
	background:url(../../static/img/article_header.png)no-repeat;
	background-size: 100% 100%;
	width: 100%;
	height: 4.373333rem; 
}
.article_body{
	padding-bottom: 1.573333rem;
	background:url(../../static/img/article_bg.png)repeat;
}
.article_contribute{
	position: fixed;
	bottom: 0;
	left: 0;
	width: 100%;
	height:1.573333rem;
	line-height:1.573333rem;
	text-align: center;
	font-size: 18px;
	color: #fff;
	background: #d42a23;
}
.article_title{
	text-align: center;;
	font-size: 18px;
	color: #d42a23;
	font-weight: bold;
	padding: 0.533333rem 0;
}
.article_content{
	text-align: justify;
	font-size: 10px;
	color: #000;
	line-height: 16px;
	padding: 0 0.666667rem
}
.article_op{
	padding:0 0.666667rem;
	display: flex;
	margin-top: 0.666667rem;
}
.article_op>div{
	flex: 1;
	font-size: 14px;
	color: #333;
}
.article_pageup{
	text-align: left;
	position: relative;
	vertical-align: middle;
	padding-left: 0.666667rem;
}
.article_pageup_icon{
	display: inline-block;
	width: 0.36rem;
	height: 0.36rem;
	background: url(../../static/img/article_arrowleft.png)no-repeat;
	background-size: 100% 100%;
	position: absolute;
	top: 50%;
	margin-top: -0.18rem;
	left: 0;

}
.article_pagedown{
	text-align: right;
	position: relative;
	vertical-align: middle;
	padding-right: 0.666667rem;
}
.article_pagedown_icon{
	display: inline-block;
	width: 0.36rem;
	height: 0.36rem;
	background: url(../../static/img/article_arrowright.png)no-repeat;
	background-size: 100% 100%;
	position: absolute;
	top: 50%;
	margin-top: -0.18rem;
	right: 0;
}
.article_o{
	text-align: right;
	padding: 0.266667rem 0.666667rem 0;
	color: #333;
}
.article_name{
	padding-bottom: 0.266667rem;
}
.article_depart{
	padding-bottom: 0.266667rem;
}
.article_o_l{
	padding: 0 0.666667rem;
	margin-top:0.266667rem;
	color: #333;
}
.article_bottom{
	width: 100%;
	height: 1.413333rem;
	background: url(../../static/img/article_bottom.png)no-repeat;
	background-size: 100%;
}	
</style>